adpyke.codesnap
alefragnani.project-manager
anthropic.claude-code
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
codeium.codeium
codezombiech.gitignore
cweijan.vscode-office
dart-code.dart-code
dart-code.flutter
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
docker.docker
donjayamanne.git-extension-pack
donjayamanne.githistory
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dsznajder.es7-react-js-snippets
dustypomerleau.rust-syntax
eamodio.gitlens
ecmel.vscode-html-css
equimper.react-native-react-redux
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.code-runner
franneck94.c-cpp-runner
google.gemini-cli-vscode-ide-companion
jasonnutter.search-node-modules
kevinrose.vsc-python-indent
leizongmin.node-module-intellisense
mechatroner.rainbow-csv
meezilla.json
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl
ms-vscode.cpptools
ms-vscode.js-debug-nightly
ms-vsliveshare.vsliveshare
msjsdiag.vscode-react-native
nhatvu148.jupiter
njpwerner.autodocstring
nucllear.vscode-extension-auto-import
openai.chatgpt
oracle.oracle-java
pmneo.tsimporter
pranaygp.vscode-css-peek
prisma.prisma
rangav.vscode-thunder-client
redhat.java
ritwickdey.liveserver
rodrigovallades.es7-react-js-snippets
rust-lang.rust-analyzer
rvest.vs-code-prettier-eslint
skyran.js-jsx-snippets
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
tomoki1207.pdf
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-java-upgrade
vscjava.vscode-maven
vscode-icons-team.vscode-icons
wholroyd.jinja
xabikos.javascriptsnippets
xabikos.reactsnippets
zainchen.json
zignd.html-css-class-completion
ziyasal.vscode-open-in-github
